app/Http/Livewire/Admin/Texts.php

update `texts` set `description` = 'Nisi molestiae accusantium autem occaecati aliquid. Fuga qui assumenda quis doloremque in. Enim cum exercitationem assumenda quod quis. Voluptatibus nisi saepe et cumque.ez', `texts`.`updated_at` = '2023-05-17 09:30:29' where `id` = 1
---
    public function updateText(Text $text)
    {
        $this->validateOnly('description');

        $text->update([
            'description' => $this->editText['description'],
        ]);

select * from `texts` order by `id` asc
---
    public function render()
    {
        $texts = Text::orderBy('id')->get();