app/Http/Livewire/Activities.php

    public function render()
    {
        $query = Activity::whereYear('start_date', $this->selectedYear)
            ->whereMonth('start_date', $this->selectedMonth)
            ->orderBy('start_date', 'desc')
            ->get();

        $selectedActivities = Activity::where('start_date', '>=', $this->selectedYear.'-'.$this->selectedMonth.'-01')
            ->where('start_date', '<=', $this->selectedYear.'-'.$this->selectedMonth.'-31')
            ->orderBy('start_date', 'desc')
            ->get();

        $years = Activity::selectRaw('YEAR(start_date) as year')->distinct()->pluck('year');
---
select * from `activities` where year(`start_date`) = 2023 and month(`start_date`) = '05' order by `start_date` desc
select * from `activities` where `start_date` >= '2023-5-01' and `start_date` <= '2023-5-31' order by `start_date` desc
select distinct YEAR(start_date) as year from `activities`