app/Http/Livewire/Filter.php

select min(`amount_of_km`) as aggregate from `routes`
select max(`amount_of_km`) as aggregate from `routes`
---
    public function mount()
    {
        $this->day = $this->defaultdate;
        $this->afstandMin = ceil(Route::min('amount_of_km'));
        $this->afstandMax = ceil(Route::max('amount_of_km'));

select * from `routes` where exists (select * from `tours` where `routes`.`id` = `tours`.`route_id`) order by `id` asc
select * from `group_tours` where (`start_date` >= '2023-05-16 00:00:00' and `group_id` like '%') order by `start_date` asc
select * from `group_tours` where exists (select * from `groups` where `group_tours`.`group_id` = `groups`.`id`) and (`start_date` = '2023-05-16' and `group_id` like '2') order by `start_date` asc
select * from `group_tours` where exists (select * from `groups` where `group_tours`.`group_id` = `groups`.`id`) and (`start_date` = '2023-05-16' and `group_id` like '%') order by `start_date` asc
select * from `groups` where exists (select * from `group_tours` where `groups`.`id` = `group_tours`.`group_id` and `start_date` = '%') order by `id` asc
select * from `group_tours` where exists (select * from `groups` where `group_tours`.`group_id` = `groups`.`id`) and (`start_date` = '%' and `group_id` like '%') order by `start_date` asc
select * from `groups` where exists (select * from `group_tours` where `groups`.`id` = `group_tours`.`group_id` and `start_date` = '2023-05-16') order by `id` asc
select * from `tours` where exists (select * from `routes` where `tours`.`route_id` = `routes`.`id` and `amount_of_km` <= 57) order by `id` asc
---
    public function render()
    {
        $now = today();
        $routes = Route::orderBy('id')->has('tours')->get();
        $groupdates = GroupTour::where([['start_date', '>=', $now],['group_id', 'like', $this->group]])
//            ->has('group')
            ->orderBy('start_date')
            ->distinct()->pluck('start_date');
//            ->get();
//            dd($groupdates);
        $this->defaultdate = $groupdates->first();
        $grouptours = GroupTour::orderBy('start_date')->has('group')
            ->where([['start_date', $this->day],['group_id','like',$this->group]])
            ->get();
        $groups = Group::orderBy('id')->whereHas('grouptours', function ($query) {
            $query->where('start_date', $this->day);})->get();
        $tours = Tour::orderBy('id')->whereHas('route', function ($query) {
                $query->where('amount_of_km', '<=', $this->afstand);})->get();