app/Http/Livewire/Filter.php

select * from `groups` where exists (select * from `group_tours` where `groups`.`id` = `group_tours`.`group_id`) and `id` like '%' order by `name` asc
---
    public function render()
    {
        $routes = Route::orderBy('id')->has('tours')->get();
        $grouptours = GroupTour::orderBy('id')
            ->where('group_id','like',$this->group)
            ->get();
        $groups = Group::orderBy('name')->with('grouptours')->get();