app/Http/Livewire/ParameterComponent.php

select `end_date_order`, `id` from `parameters`
---
    public function mount()
    {
        $this->parameters = Parameter::all(['end_date_order', 'id']);

insert into `parameters` (`end_date_order`, `updated_at`, `created_at`) values ('2023-06-01', '2023-05-17 09:30:51', '2023-05-17 09:30:51')
---
    public function store()
    {
        $this->validate([
            'end_date_order' => 'required',
        ]);

        Parameter::create([
            'end_date_order' => $this->end_date_order,
        ]);

select * from `parameters` where `parameters`.`id` = '1' limit 1
delete from `parameters` where `id` = 1
---
    public function destroy()
    {
        $parameter = Parameter::findOrFail($this->parameter_id_delete);
        $parameter->delete();

select * from `parameters` where `parameters`.`id` = '1' limit 1
---
    public function render()
    {
        return view('livewire.parameter-component' , [
            'parameters' => Parameter::all()
        ]);

update `parameters` set `end_date_order` = '2023-06-03', `parameters`.`updated_at` = '2023-05-17 09:31:07' where `id` = 1
---
    public function update()
    {
        $this->validate([
            'selectedParameterId' => 'required',
            'end_date_order' => 'required|date',
        ]);

        $parameter = Parameter::findOrFail($this->selectedParameterId);

        $parameter->update([
            'end_date_order' => $this->end_date_order,
        ]);