app/Http/Livewire/Sponsor.php

select * from `images` where `image_type_id` = 1
---
    public function render()
    {
        $images = Image::where('image_type_id', 2)->get();