app/Models/GroupTour.php

select * from `groups` where `groups`.`id` = 1 limit 1
---
    protected function groupName(): Attribute
    {
        return Attribute::make(
            get: fn($value, $attributes) => Group::find($attributes['group_id'])->name,
        );